[
    {
        "view": "null",
        "name": "Hartej Singh",
        "title": "Technology Architect",
        "company": "Cognizant",
        "phone": "",
        "image": "../../images/dd.jpg",
        "date": "2018-06-08",
        "text": "I have had the pleasure of working with DD on more than one occasion, recently at Meridian Health. DD has a brilliant grasp on what architectural aspects need immediate attention and works aggressively to deliver future-proof designs. DD also has a great personality characterized by accessibility and humorous charm which makes you want to work with him"
    },
    {
        "view": "null",
        "name": "Madhu Aravabhumi",
        "title": "Senior Advisory Consultant",
        "company": "IBM",
        "phone": "",
        "image": "../../images/dd.jpg",
        "date": "2018-05-22",
        "text": "This is my first recommendation at Linkedin !! and I am big follower of DD. Darrell is the one of the best team lead I ever worked. It was really great opportunity to work with such a guru. I really enjoyed working with himat IM. He introduced me to both current process and improved process at Continuous Integration and Continuous Delivery. I was really impressed with his innovative thoughts towards the continuous improvement process while working with him at IM RC2 project and always feel lucky to have Darrell as my mentor all the time. I can split my career as before DD and after DD"
    },
    {
        "view": "null",
        "name": "Bob Binion",
        "title": "Vice President of Architecture",
        "company": "Monetate, Inc.",
        "phone": "",
        "image": "../../images/dd.jpg",
        "date": "2017-04-02",
        "text": "Darrell was a great value to the team and he could always be relied upon to get the job done, with integrity and quality. Darrell never shied away from a challenge, and was always eager to learn new skills and broaden his contributions to the team. I enjoyed working with Darrell and would be happy to do so again in the future"
    },
    {
        "view": "null",
        "name": "Andrew Hamilton",
        "title": "Senior Devops Engineer",
        "company": "Cisco",
        "phone": "",
        "image": "../../images/dd.jpg",
        "date": "2017-02-17",
        "text": "Over the course of more than 20 years of working in the IT industry in various capacities, I have rarely come across anyone that I have enjoyed working with more than Darrell. His desire to not only get the job done, but get the job done right is unmatched. In the nearly 2 years that we worked together at Iron Mountain, we completely revamped the configuration management and deployment processes for IM's flagship application, improving performance by more than an order of magnitude and thereby becoming the example of how things get done. This improvement was due in large part to Darrell's vision and deep understanding of the technologies and processes involved. I would recommend Darrell to any team that wants to increase their opportunities for success"
    },
    {
        "view": "null",
        "name": "Dennis Burrill",
        "title": "IT Executive | Proven Leader | Architecture | Integration | Team Building | Process Management | APIs | Solution Focused",
        "company": "",
        "phone": "",
        "image": "../../images/dd.jpg",
        "date": "2010-11-10",
        "text": "Darrell has an excellent understanding of software development and the effects that system design has acrross the application, network, database and systems. Darrell has excellent communication skills and mentors/learns from his fellow employees."

    },
    {
        "view": "null",
        "name": "James Clifford III",
        "title": "Director of IS",
        "company": "D&H Distributing",
        "phone": "717-255-7823",
        "image": "../../images/dd.jpg",
        "text": "Darrell is a well rounded professional who I look up to and learned from. His technical abilities are A+ but that is just the beginning. He is someone that can really do it all, our toughest problems are what he handled for D&H, his communications are excellent, his people and project management skills are dead on. IF you are looking for a manager of people and projects who can roll up his sleeves and make it happen if need be, he would be a great choice for you. We had to part ways because of a downsizing and I would hire him back in a minute.",
        "date": "2010-10-19"
    },
    {  
        "view": "null",
        "name": "Glen West",
        "title": "Enterprise Architect",
        "company": "D&H Distributing",
        "phone": "Glen.west@gmail.com",
        "image": "../../images/dd.jpg",
        "text": "Darrell has a breadth of technical knowledge normally found in Architects and is well versed in all current Progress technologies. He constantly shared his knowledge with others, helping them achieve their goals as well as achieving his own. Darrell has a good business sense as well, and the ability to communicate clearly and easily with both the business user and the developer. His positive demeanor made him a pleasure to work with and be around. I would love to work with him again in any environment.",
        "date": "2009-10-27"
    },
    { 
        "view": "null",
        "name": "Mark Karmazin",
        "title": "Equity Support Manager",
        "company": "Credit Suisse",
        "phone": "212-325-4068",
        "image": "../../images/dd.jpg",
        "text": "Darrell is a very detail oriented, responsible and reliable professional. It was an extreme pleasure to work with him, he was very proactive in his approach to problem solving which was key to the role he played at Credit Suisse and generally very proactive in finding new and innovative way to conducting our day to day tasks. Darrell is very knowledgeable technically and would offer his skill set to others when they required help. I feel Darrell would be a great contributor in any setting and in any line of business.",
        "date": "2009-05-19"
    },
    { 
        "view": "null",
        "name": "Doug Lucy",
        "title": "President/CEO ",
        "company": "Allegro Consultants",
        "phone": "804-527-6231",
        "image": "../../images/dd.jpg",
        "text": "Darrell is one of those rare self-motivated, highly aware techies who is eager to take direct responsibility for a tough, intricate project or task and work hard on it until it is complete and delivering as promised. He enjoys digging into various technologies, languages and tools, even if he has not been formally trained on them. That alone makes him highly valuable when you team has to be lean and nimble yet effective across many business problems. I highly recommend Darrell where results are important, you need someone who is confident yet capable, and can be relied on to accomplish the task.",
        "date": "2010-05-05"
    },
    { 
        "view": "null",
        "name": "Chris Combs",
        "title": "CIO",
        "company": "Pet Partners Inc",
        "phone": "919-859-8240",
        "image": "../../images/dd.jpg",
        "text":  "... our experience in recovery with Darrell Davis was excellent.  Darrell came in (By parachute to use a metaphor) into our disaster zone, and helped us recover from a very difficult situation.  As of Thursday of last week, we were back in business running better with our existing application running on a new server better and faster than we ever had under our old server environment.  What more can I say than that Darrell, as a representative of Allegro, gave us excellent service and support, and got our entire company back up and running in less than one week.",
        "date": "2009-02-07"
    },
    { 
        "view": "null",
        "name": "Eileen Torrens",
        "title": "Asst VP DBA",
        "company": "American Home Mortgage",
        "phone": "631-433-9213",
        "image": "../../images/dd.jpg",
        "text":  "Darrell is an extremely intelligent, talented and motivated professional. He continually looks at things in relation to the big picture. He provides sound, enterprise level solutions to issues.  Darrell has an indepth understanding of RDMBS platforms and can easily apply this knowledge across individual systems. I would gladly work with Darrell again.",
        "date": "2008-10-14"
    },
    { 
        "view": "null",
        "name": "James Rossi",
        "title": "Support Manager",
        "company": "Allegro Consultants, Ltd.",
        "phone": "804-381-8574",
        "image": "../../images/dd.jpg",
        "text": "Whenever I am given a chance to work with Darrell, I know the project will complete without a hitch. He is one of those rare individuals who can tackle any task he is given and come out looking as if he is an old pro, even if it is something new to him. He is also very personable, but also know the technical as well as anyone, another rare, but valuable combination. Darrell is an asset to whichever client he is performing work for.",
        "date": "2008-05-06"
    },
    { 
        "view": "null",
        "name": "Steve Filiberto",
        "title": "Progress/Oracle/MSSQL DBA",
        "company": "American Home Mortgage",
        "phone": "631-447-0690",
        "image": "../../images/dd.jpg",
        "text": "Quite simply, Darrell Davis is the best DBA I ever worked with. It was a pleasure and an honor to work with him. His expert knowledge of database architecture, design and systems engineering make him unique.",
        "date": "2008-04-11"
    }
]